MikroElektronika/core_packages/ARM/gcc_clang/def/silabs/EZR32HG320F64R69/mcu.h
/** @} End of group EZR32HG320F64R69_RF_Interface */

/** @} End of group EZR32HG320F64R69_Part */

#define ARM_MATH_CM0PLUS
// #include "core_cm0plus.h" /* Cortex-M0+ processor and core peripherals */  // Note: Changed for MikroE implementation.
// #include "system_ezr32hg.h" /* System Header */  // Note: Changed for MikroE implementation.
#include <stdint.h>
#define     __I     volatile const       /*!< Defines 'read only' permissions */
#define     __O     volatile             /*!< Defines 'write only' permissions */
#define     __IO    volatile             /*!< Defines 'read / write' permissions */

/* following defines should be used for structure members */
#define     __IM     volatile const      /*! Defines 'read only' structure member permissions */
#define     __OM     volatile            /*! Defines 'write only' structure member permissions */
#define     __IOM    volatile            /*! Defines 'read / write' structure member permissions */

typedef struct {
  __IOM uint32_t CTRL; /**< Channel Control Register  */
} PRS_CH_TypeDef;

typedef struct {
  __IOM uint32_t CTRL; /**< Channel Control Register  */
} DMA_CH_TypeDef;

typedef struct {
  __IOM uint32_t CFG;                                /**< Configuration                                      */
  __IOM uint32_t LOOP;                               /**< Loop Counter                                       */
  __IOM uint32_t CTRL;                               /**< Control                                            */
  __IOM uint32_t SRC;                                /**< Source Address                                     */
  __IOM uint32_t DST;                                /**< Destination Address                                */
  __IOM uint32_t LINK;                               /**< Link Address                                       */
  __IOM uint32_t XCTRL;                              /**< Extended Control                                   */
  uint32_t       RESERVED0[1U];                      /**< Reserved for future use                            */
  __IOM uint32_t ILSRC;                              /**< Interleaving Source Address                        */
  uint32_t       RESERVED1[3U];                      /**< Reserved for future use                            */
} LDMA_CH_TypeDef;

/***************************************************************************//**
 * @defgroup EZR32HG320F64R69_Peripheral_TypeDefs EZR32HG320F64R69 Peripheral TypeDefs
 * @{
 * @brief Device Specific Peripheral Register Structures
 ******************************************************************************/

// #include "ezr32hg_aes.h"  // Note: Changed for MikroE implementation.
// #include "ezr32hg_dma_ch.h"  // Note: Changed for MikroE implementation.
// #include "ezr32hg_dma.h"  // Note: Changed for MikroE implementation.
// #include "ezr32hg_usb_diep.h"  // Note: Changed for MikroE implementation.
// #include "ezr32hg_usb_doep.h"  // Note: Changed for MikroE implementation.
// #include "ezr32hg_usb.h"  // Note: Changed for MikroE implementation.
// #include "ezr32hg_msc.h"  // Note: Changed for MikroE implementation.
// #include "ezr32hg_emu.h"  // Note: Changed for MikroE implementation.
// #include "ezr32hg_rmu.h"  // Note: Changed for MikroE implementation.
// #include "ezr32hg_cmu.h"  // Note: Changed for MikroE implementation.
// #include "ezr32hg_timer_cc.h"  // Note: Changed for MikroE implementation.
// #include "ezr32hg_timer.h"  // Note: Changed for MikroE implementation.
// #include "ezr32hg_usart.h"  // Note: Changed for MikroE implementation.
// #include "ezr32hg_prs_ch.h"  // Note: Changed for MikroE implementation.
// #include "ezr32hg_prs.h"  // Note: Changed for MikroE implementation.
// #include "ezr32hg_idac.h"  // Note: Changed for MikroE implementation.
// #include "ezr32hg_gpio_p.h"  // Note: Changed for MikroE implementation.
// #include "ezr32hg_gpio.h"  // Note: Changed for MikroE implementation.
// #include "ezr32hg_vcmp.h"  // Note: Changed for MikroE implementation.
// #include "ezr32hg_adc.h"  // Note: Changed for MikroE implementation.
// #include "ezr32hg_leuart.h"  // Note: Changed for MikroE implementation.
// #include "ezr32hg_pcnt.h"  // Note: Changed for MikroE implementation.
// #include "ezr32hg_i2c.h"  // Note: Changed for MikroE implementation.
// #include "ezr32hg_rtc.h"  // Note: Changed for MikroE implementation.
// #include "ezr32hg_wdog.h"  // Note: Changed for MikroE implementation.
// #include "ezr32hg_mtb.h"  // Note: Changed for MikroE implementation.
// #include "ezr32hg_dma_descriptor.h"  // Note: Changed for MikroE implementation.
// #include "ezr32hg_devinfo.h"  // Note: Changed for MikroE implementation.
// #include "ezr32hg_romtable.h"  // Note: Changed for MikroE implementation.
// #include "ezr32hg_calibrate.h"  // Note: Changed for MikroE implementation.

/** @} End of group EZR32HG320F64R69_Peripheral_TypeDefs */

/***************************************************************************//**
 * @defgroup EZR32HG320F64R69_Peripheral_Base EZR32HG320F64R69 Peripheral Memory Map
 * @{
 ******************************************************************************/

#define AES_BASE          (0x400E0000UL) /**< AES base address  */
#define DMA_BASE          (0x400C2000UL) /**< DMA base address  */
#define USB_BASE          (0x400C4000UL) /**< USB base address  */
#define MSC_BASE          (0x400C0000UL) /**< MSC base address  */
#define EMU_BASE          (0x400C6000UL) /**< EMU base address  */
#define RMU_BASE          (0x400CA000UL) /**< RMU base address  */
#define CMU_BASE          (0x400C8000UL) /**< CMU base address  */
#define TIMER0_BASE       (0x40010000UL) /**< TIMER0 base address  */
#define TIMER1_BASE       (0x40010400UL) /**< TIMER1 base address  */
#define TIMER2_BASE       (0x40010800UL) /**< TIMER2 base address  */
#define USART0_BASE       (0x4000C000UL) /**< USART0 base address  */
#define USARTRF1_BASE     (0x4000C400UL) /**< USARTRF1 base address  */
#define PRS_BASE          (0x400CC000UL) /**< PRS base address  */
#define IDAC0_BASE        (0x40004000UL) /**< IDAC0 base address  */
#define GPIO_BASE         (0x40006000UL) /**< GPIO base address  */
#define VCMP_BASE         (0x40000000UL) /**< VCMP base address  */
#define ADC0_BASE         (0x40002000UL) /**< ADC0 base address  */
#define LEUART0_BASE      (0x40084000UL) /**< LEUART0 base address  */
#define PCNT0_BASE        (0x40086000UL) /**< PCNT0 base address  */
#define I2C0_BASE         (0x4000A000UL) /**< I2C0 base address  */
#define RTC_BASE          (0x40080000UL) /**< RTC base address  */
#define WDOG_BASE         (0x40088000UL) /**< WDOG base address  */
#define MTB_BASE          (0xF0040000UL) /**< MTB base address  */
#define CALIBRATE_BASE    (0x0FE08000UL) /**< CALIBRATE base address */
#define DEVINFO_BASE      (0x0FE081A8UL) /**< DEVINFO base address */
#define ROMTABLE_BASE     (0xF00FFFD0UL) /**< ROMTABLE base address */
#define LOCKBITS_BASE     (0x0FE04000UL) /**< Lock-bits page base address */
#define USERDATA_BASE     (0x0FE00000UL) /**< User data page base address */

/** @} End of group EZR32HG320F64R69_Peripheral_Base */

/***************************************************************************//**
 * @defgroup EZR32HG320F64R69_Peripheral_Declaration  EZR32HG320F64R69 Peripheral Declarations
 * @{
 ******************************************************************************/

#define AES          ((AES_TypeDef *) AES_BASE)             /**< AES base pointer */
#define DMA          ((DMA_TypeDef *) DMA_BASE)             /**< DMA base pointer */
#define USB          ((USB_TypeDef *) USB_BASE)             /**< USB base pointer */
#define MSC          ((MSC_TypeDef *) MSC_BASE)             /**< MSC base pointer */
#define EMU          ((EMU_TypeDef *) EMU_BASE)             /**< EMU base pointer */
#define RMU          ((RMU_TypeDef *) RMU_BASE)             /**< RMU base pointer */
#define CMU          ((CMU_TypeDef *) CMU_BASE)             /**< CMU base pointer */
#define TIMER0       ((TIMER_TypeDef *) TIMER0_BASE)        /**< TIMER0 base pointer */
#define TIMER1       ((TIMER_TypeDef *) TIMER1_BASE)        /**< TIMER1 base pointer */
#define TIMER2       ((TIMER_TypeDef *) TIMER2_BASE)        /**< TIMER2 base pointer */
#define USART0       ((USART_TypeDef *) USART0_BASE)        /**< USART0 base pointer */
#define USARTRF1     ((USART_TypeDef *) USARTRF1_BASE)      /**< USARTRF1 base pointer */
#define PRS          ((PRS_TypeDef *) PRS_BASE)             /**< PRS base pointer */
#define IDAC0        ((IDAC_TypeDef *) IDAC0_BASE)          /**< IDAC0 base pointer */
#define GPIO         ((GPIO_TypeDef *) GPIO_BASE)           /**< GPIO base pointer */
#define VCMP         ((VCMP_TypeDef *) VCMP_BASE)           /**< VCMP base pointer */
#define ADC0         ((ADC_TypeDef *) ADC0_BASE)            /**< ADC0 base pointer */
#define LEUART0      ((LEUART_TypeDef *) LEUART0_BASE)      /**< LEUART0 base pointer */
#define PCNT0        ((PCNT_TypeDef *) PCNT0_BASE)          /**< PCNT0 base pointer */
#define I2C0         ((I2C_TypeDef *) I2C0_BASE)            /**< I2C0 base pointer */
#define RTC          ((RTC_TypeDef *) RTC_BASE)             /**< RTC base pointer */
#define WDOG         ((WDOG_TypeDef *) WDOG_BASE)           /**< WDOG base pointer */
#define MTB          ((MTB_TypeDef *) MTB_BASE)             /**< MTB base pointer */
#define CALIBRATE    ((CALIBRATE_TypeDef *) CALIBRATE_BASE) /**< CALIBRATE base pointer */
#define DEVINFO      ((DEVINFO_TypeDef *) DEVINFO_BASE)     /**< DEVINFO base pointer */
#define ROMTABLE     ((ROMTABLE_TypeDef *) ROMTABLE_BASE)   /**< ROMTABLE base pointer */

