MikroElektronika/core_packages/ARM/gcc_clang/def/silabs/EZR32HG320F64R69/mcu.h
/** @} End of group EZR32HG320F64R69_Peripheral_Declaration */

/***************************************************************************//**
 * @defgroup EZR32HG320F64R69_BitFields EZR32HG320F64R69 Bit Fields
 * @{
 ******************************************************************************/

// #include "ezr32hg_prs_signals.h"  // Note: Changed for MikroE implementation.
// #include "ezr32hg_dmareq.h"  // Note: Changed for MikroE implementation.
// #include "ezr32hg_dmactrl.h"  // Note: Changed for MikroE implementation.
// #include "ezr32hg_usartrf.h"  // Note: Changed for MikroE implementation.

/***************************************************************************//**
 * @defgroup EZR32HG320F64R69_UNLOCK EZR32HG320F64R69 Unlock Codes
 * @{
 ******************************************************************************/
#define MSC_UNLOCK_CODE      0x1B71 /**< MSC unlock code */
#define EMU_UNLOCK_CODE      0xADE8 /**< EMU unlock code */
#define CMU_UNLOCK_CODE      0x580E /**< CMU unlock code */
#define TIMER_UNLOCK_CODE    0xCE80 /**< TIMER unlock code */
#define GPIO_UNLOCK_CODE     0xA534 /**< GPIO unlock code */

/** @} End of group EZR32HG320F64R69_UNLOCK */

/** @} End of group EZR32HG320F64R69_BitFields */

/***************************************************************************//**
 * @defgroup EZR32HG320F64R69_Alternate_Function EZR32HG320F64R69 Alternate Function
 * @{
 ******************************************************************************/

// #include "ezr32hg_af_ports.h"  // Note: Changed for MikroE implementation.
// #include "ezr32hg_af_pins.h"  // Note: Changed for MikroE implementation.

/** @} End of group EZR32HG320F64R69_Alternate_Function */

/***************************************************************************//**
 *  @brief Set the value of a bit field within a register.
 *
 *  @param REG
 *       The register to up2026-04-27
 *  @param MASK
 *       The mask for the bit field to up2026-04-27
 *  @param VALUE
 *       The value to write to the bit field
 *  @param OFFSET
 *       The number of bits that the field is offset within the register.
 *       0 (zero) means LSB.
 ******************************************************************************/
#define SET_BIT_FIELD(REG, MASK, VALUE, OFFSET) \
  REG = ((REG) &~(MASK)) | (((VALUE) << (OFFSET)) & (MASK));

/** @} End of group EZR32HG320F64R69 */

/** @} End of group Parts */

#ifdef __cplusplus
}
#endif

#endif /* EZR32HG320F64R69_H */
